In [1]:
import pandas as pd

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', "Doe", 'Doe'],
    'email': ['cs@gmail.com', 'jd@gmail.com', 'jd@email.com']
}
df = pd.DataFrame(people)

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [37]:
df['email']

0    cs@gmail.com
1    jd@gmail.com
2    jd@email.com
Name: email, dtype: object

In [38]:
df.set_index('email', inplace=True)

In [39]:
df

              first     last
email
cs@gmail.com  Corey  Schafer
jd@gmail.com   Jane      Doe
jd@email.com   John      Doe

In [40]:
df.index

Index(['cs@gmail.com', 'jd@gmail.com', 'jd@email.com'], dtype='object', name='email')

In [41]:
df.loc['cs@gmail.com', 'last']

'Schafer'

In [42]:
df.iloc[0]

first      Corey
last     Schafer
Name: cs@gmail.com, dtype: object

In [43]:
df.reset_index(inplace=True)
df

          email  first     last
0  cs@gmail.com  Corey  Schafer
1  jd@gmail.com   Jane      Doe
2  jd@email.com   John      Doe

In [47]:
df

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [55]:
filt = (df['last'] == 'Doe')

In [60]:
#df[filt] ##using .loc now

  first last         email
1  Jane  Doe  jd@gmail.com
2  John  Doe  jd@email.com

In [63]:
df.loc[filt]

  first last         email
1  Jane  Doe  jd@gmail.com
2  John  Doe  jd@email.com

In [64]:
df.loc[filt, 'email']

1    jd@gmail.com
2    jd@email.com
Name: email, dtype: object

In [65]:
filt = (df['last'] == 'Doe') & (df['first'] == 'John')

In [67]:
df.loc[filt, 'email']

2    jd@email.com
Name: email, dtype: object

In [68]:
filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [69]:
df.loc[filt, 'email']

0    cs@gmail.com
2    jd@email.com
Name: email, dtype: object

In [70]:
df.loc[~filt, 'email']

1    jd@gmail.com
Name: email, dtype: object

In [4]:
df

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
type(df.columns)

pandas.core.indexes.base.Index

In [7]:
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [9]:
df

  first_name last_name         email
0      Corey   Schafer  cs@gmail.com
1       Jane       Doe  jd@gmail.com
2       John       Doe  jd@email.com

In [10]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME         EMAIL
0      Corey   Schafer  cs@gmail.com
1       Jane       Doe  jd@gmail.com
2       John       Doe  jd@email.com

In [11]:
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME         EMAIL
0      Corey   Schafer  cs@gmail.com
1       Jane       Doe  jd@gmail.com
2       John       Doe  jd@email.com

In [12]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME         EMAIL
0      Corey   Schafer  cs@gmail.com
1       Jane       Doe  jd@gmail.com
2       John       Doe  jd@email.com

In [13]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name         email
0      Corey   Schafer  cs@gmail.com
1       Jane       Doe  jd@gmail.com
2       John       Doe  jd@email.com

In [14]:
df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [15]:
df.loc[2]

first            John
last              Doe
email    jd@email.com
Name: 2, dtype: object

In [16]:
type(df.loc[2])

pandas.core.series.Series

In [17]:
df.loc[2] = ['John', 'Smith', 'johnsmith@email.com']
df

   first     last                email
0  Corey  Schafer         cs@gmail.com
1   Jane      Doe         jd@gmail.com
2   John    Smith  johnsmith@email.com

In [18]:
df.loc[2, ['last', 'email']]

last                   Smith
email    johnsmith@email.com
Name: 2, dtype: object

In [19]:
type(df.loc[2, ['last', 'email']])

pandas.core.series.Series

In [20]:
df.loc[2, ['last', 'email']] = ['Doe', 'johndoe@email.com']
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John      Doe  johndoe@email.com

In [21]:
df.loc[2, 'last'] = 'Smith'
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John    Smith  johndoe@email.com

In [22]:
df.at[2, 'last'] = 'Doe'
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John      Doe  johndoe@email.com

In [23]:
filt = (df['email'] == 'johndoe@email.com')
df[filt]

  first last              email
2  John  Doe  johndoe@email.com

In [25]:
type(df[filt])

pandas.core.frame.DataFrame

In [24]:
filt = (df['email'] == 'johndoe@email.com')
df[filt]['last']

2    Doe
Name: last, dtype: object

In [26]:
type(df[filt]['last'])

pandas.core.series.Series

In [28]:
filt = (df['email'] == 'johndoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [29]:
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John    Smith  johndoe@email.com

In [30]:
type(df['email'])

pandas.core.series.Series

In [31]:
type(df['email'].str)

pandas.core.strings.accessor.StringMethods

In [32]:
df['email'].str.lower()

0         cs@gmail.com
1         jd@gmail.com
2    johndoe@email.com
Name: email, dtype: object

In [36]:
df['email'] = df['email'].str.upper()
df

   first     last              email
0  Corey  Schafer       CS@GMAIL.COM
1   Jane      Doe       JD@GMAIL.COM
2   John    Smith  JOHNDOE@EMAIL.COM

In [37]:
df['email'] = df['email'].str.lower()
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John    Smith  johndoe@email.com

In [38]:
type(df['email'].apply(len))

pandas.core.series.Series

In [39]:
df['email'].apply(len)

0    12
1    12
2    17
Name: email, dtype: int64

In [40]:
def update_email(email):
    return email.upper()

In [44]:
df['email'].apply(update_email)

0         CS@GMAIL.COM
1         JD@GMAIL.COM
2    JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [42]:
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John    Smith  johndoe@email.com

In [45]:
df['email'] = df['email'].apply(update_email)
df

   first     last              email
0  Corey  Schafer       CS@GMAIL.COM
1   Jane      Doe       JD@GMAIL.COM
2   John    Smith  JOHNDOE@EMAIL.COM

In [46]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John    Smith  johndoe@email.com

In [47]:
df['email'].apply(len)

0    12
1    12
2    17
Name: email, dtype: int64

In [48]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [49]:
df.apply(pd.Series.min)

first           Corey
last              Doe
email    cs@gmail.com
dtype: object

In [50]:
df.apply(lambda x: x.min())

first           Corey
last              Doe
email    cs@gmail.com
dtype: object

In [51]:
df.applymap(len)

   first  last  email
0      5     7     12
1      4     3     12
2      4     5     17

In [53]:
df.applymap(str.upper)

   first     last              email
0  COREY  SCHAFER       CS@GMAIL.COM
1   JANE      DOE       JD@GMAIL.COM
2   JOHN    SMITH  JOHNDOE@EMAIL.COM

In [54]:
df.applymap(str.lower)

   first     last              email
0  corey  schafer       cs@gmail.com
1   jane      doe       jd@gmail.com
2   john    smith  johndoe@email.com

In [56]:
df

   first     last              email
0  Corey  Schafer       cs@gmail.com
1   Jane      Doe       jd@gmail.com
2   John    Smith  johndoe@email.com

In [57]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [58]:
df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [6]:
df

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [7]:
df['first']+' '+ df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [8]:
df['full_name'] = df['first']+' '+ df['last']

In [9]:
df

   first     last         email      full_name
0  Corey  Schafer  cs@gmail.com  Corey Schafer
1   Jane      Doe  jd@gmail.com       Jane Doe
2   John      Doe  jd@email.com       John Doe

In [12]:
df.drop(columns=['first', 'last'],inplace=True)

In [13]:
df

          email      full_name
0  cs@gmail.com  Corey Schafer
1  jd@gmail.com       Jane Doe
2  jd@email.com       John Doe

In [14]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [15]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [16]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [17]:
df

          email      full_name  first     last
0  cs@gmail.com  Corey Schafer  Corey  Schafer
1  jd@gmail.com       Jane Doe   Jane      Doe
2  jd@email.com       John Doe   John      Doe

In [19]:
df.append({'first': 'Tony'}, ignore_index=True)

          email      full_name  first     last
0  cs@gmail.com  Corey Schafer  Corey  Schafer
1  jd@gmail.com       Jane Doe   Jane      Doe
2  jd@email.com       John Doe   John      Doe
3           NaN            NaN   Tony      NaN

In [26]:
people2 = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', "Rodgers"],
    'email': ['IronMan@avenge.com', 'Cap@avenge,com']
}

In [30]:
df2 = pd.DataFrame(people2)

In [31]:
df.append(df2, ignore_index=True)

   first     last               email
0  Corey  Schafer        cs@gmail.com
1   Jane      Doe        jd@gmail.com
2   John      Doe        jd@email.com
3   Tony    Stark  IronMan@avenge.com
4  Steve  Rodgers      Cap@avenge,com

In [32]:
df = df.append(df2, ignore_index=True)

In [33]:
df

   first     last               email
0  Corey  Schafer        cs@gmail.com
1   Jane      Doe        jd@gmail.com
2   John      Doe        jd@email.com
3   Tony    Stark  IronMan@avenge.com
4  Steve  Rodgers      Cap@avenge,com

In [35]:
df.drop(index=4, inplace=True)

In [36]:
df

   first     last               email
0  Corey  Schafer        cs@gmail.com
1   Jane      Doe        jd@gmail.com
2   John      Doe        jd@email.com
3   Tony    Stark  IronMan@avenge.com

In [37]:
df.drop(index=df[df['last'] == 'Doe'].index)

   first     last               email
0  Corey  Schafer        cs@gmail.com
3   Tony    Stark  IronMan@avenge.com

In [5]:
df.sort_values(by='last')

   first     last         email
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com
0  Corey  Schafer  cs@gmail.com

In [6]:
df.sort_values(by='last', ascending=False)

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [7]:
df.sort_values(by=['last','first'], ascending=False)

   first     last         email
0  Corey  Schafer  cs@gmail.com
2   John      Doe  jd@email.com
1   Jane      Doe  jd@gmail.com

In [8]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Adam'],
    'last': ['Schafer', "Doe", 'Doe', 'Doe'],
    'email': ['cs@gmail.com', 'jd@gmail.com', 'jd@email.com', 'A@email.com']
}
df = pd.DataFrame(people)

In [9]:
df.sort_values(by=['last','first'], ascending=False)

   first     last         email
0  Corey  Schafer  cs@gmail.com
2   John      Doe  jd@email.com
1   Jane      Doe  jd@gmail.com
3   Adam      Doe   A@email.com

In [11]:
df.sort_values(by=['last','first'], ascending=[False, True], inplace=True)

In [12]:
df

   first     last         email
0  Corey  Schafer  cs@gmail.com
3   Adam      Doe   A@email.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com

In [13]:
df.sort_index()

   first     last         email
0  Corey  Schafer  cs@gmail.com
1   Jane      Doe  jd@gmail.com
2   John      Doe  jd@email.com
3   Adam      Doe   A@email.com

In [14]:
df['last'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object